src/main/resources/bamboo_seat_32f_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sim="http://www.ibsplc.com/iRes/simpleTypes/">
    <soapenv:Header/>
    <soapenv:Body>
        <sim:ShowSeatMapRQ>
            <AirlineCode>QH</AirlineCode>
            <SegmentInfo>
                <BoardPoint>SGN</BoardPoint>
                <OffPoint>VII</OffPoint>
            </SegmentInfo>
            <BookingChannel>
                <!--Optional:-->
                <ChannelType>API</ChannelType>
                <!--Optional:-->
                <Channel>MOMO</Channel>
                <!--Optional:-->
                <Locale>en_US</Locale>
            </BookingChannel>
            <FlightIdentifier>
                <fltNumber>1152</fltNumber>
                <airlineCode>QH</airlineCode>
                <flightDate>
                    <Date>2021-05-30Z</Date>
                </flightDate>
                <fltSuffix>*</fltSuffix>
                <carrierCode>QH</carrierCode>
            </FlightIdentifier>
            <isSeatFeeRequired>true</isSeatFeeRequired>
            <PointOfSale>VN</PointOfSale>
            <Itinerary>
                <FlightSegmentDetails>
                    <FlightSegmentGroupID>1</FlightSegmentGroupID>
                    <SegmentId>1</SegmentId>
                    <carrierCode>QH</carrierCode>
                    <fltNumber>1152</fltNumber>
                    <fltSuffix>*</fltSuffix>
                    <flightDate>
                        <Date>2021-05-30Z</Date>
                    </flightDate>
                    <boardPoint>SGN</boardPoint>
                    <offPoint>VII</offPoint>
                    <scheduledDepartureDateTime>2021-05-30T13:35:00+00:07</scheduledDepartureDateTime>
                    <DepartureTimeZone>GMT+07:00</DepartureTimeZone>
                    <scheduledArrivalTime>2021-05-30T15:30:00+00:07</scheduledArrivalTime>
                    <ArrivalTimeZone>GMT+07:00</ArrivalTimeZone>
                    <journeyTime>01:55</journeyTime>
                    <stops>0</stops>
                    <arrivalDayChange>0</arrivalDayChange>
                    <CabinClass>ECONOMY</CabinClass>
                    <FlightStatus>OPEN</FlightStatus>
                    <isThroughFlight>false</isThroughFlight>
                    <isDeiExists>false</isDeiExists>
                    <FareClass>V</FareClass>
                </FlightSegmentDetails>
            </Itinerary>
        </sim:ShowSeatMapRQ>
    </soapenv:Body>
</soapenv:Envelope>